ka2_2024/src/DataProcessors/ЕдиныйНалоговыйСчетЛичныйКабинет/ЕдиныйНалоговыйСчетЛичныйКабинет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЕдиныйНалоговыйСчетЛичныйКабинет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ka2_2024/src/InformationRegisters/СостоянияПодключенияЕНС/СостоянияПодключенияЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПодключенияЕНС</name>
  <resources>
    <name>ИнтеграцияПодключена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьФоновыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЖурналирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпособАвторизации</name>
    <type>
      <types>EnumRef.СпособыАвторизацииКСервисуЕНС</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСервисДанныхЕНС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредельнаяДатаЖурналирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/ПериодыОбновленияДанныхЕНС/ПериодыОбновленияДанныхЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодыОбновленияДанныхЕНС</name>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.ВидыДанныхЛичногоКабинетаЕНС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/ЖурналЗагрузкиЕНС/ЖурналЗагрузкиЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналЗагрузкиЕНС</name>
  <resources>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЖурналЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/DataProcessors/ЕдиныйНалоговыйСчетЛичныйКабинет/Forms/ФормаНастройкиЛичногоКабинета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = Параметры.Организация;
	
	МожноОчиститьДанные = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДанныеЛичногоКабинетаЕНС);
	
	ПрочитатьСостояниеИнтеграции();
	
	Элементы.ГруппаЖурналирование.ТолькоПросмотр = Не ИнтеграцияПодключена;
	Элементы.ГруппаОчисткаДанных.Видимость = ИнтеграцияПодключена И МожноОчиститьДанные;
	
	ИспользоватьСервисДанныхЕНС = РегистрыСведений.СостоянияПодключенияЕНС.ПолучитьИспользоватьСервисДанныхЕНС(Объект.Организация);
	
	Если ИнтеграцияПодключена Тогда
		ПрочитатьДатуПоследнегоОбновления();
	КонецЕсли;
	
	Элементы.ОчиститьВсеДанные.Доступность = ЗначениеЗаполнено(ДатаПоследнегоОбновления) И МожноОчиститьДанные;
	Элементы.ИспользоватьЖурналирование.Доступность = МожноОчиститьДанные;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьЖурналированиеПриИзменении(Элемент)
	
	ИспользоватьЖурналированиеПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаборыДанныхЕНС(Команда)
	
	ОткрытьФорму("Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет.Форма.НаборыДанныхЕНС");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеЛичногоКабинета(Команда)
	
	Если ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьДанныеПослеПолученияОтвета", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Будут удалены ранее загруженные данные ЕНС.
			|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьСостояниеИнтеграции()
	
	СтруктураПараметров = РегистрыСведений.СостоянияПодключенияЕНС.ПолучитьСостяниеПодключения(Объект.Организация);
	
	Если Не НастройкиЖурналированияКорректны(СтруктураПараметров) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		РегистрыСведений.СостоянияПодключенияЕНС.ОтключитьЖурналирование(Объект.Организация);
		УстановитьПривилегированныйРежим(Ложь);
		СтруктураПараметров = РегистрыСведений.СостоянияПодключенияЕНС.ПолучитьСостяниеПодключения(Объект.Организация);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеИнтеграции()
	
	СтруктураПараметров = РегистрыСведений.СостоянияПодключенияЕНС.СтруктураПараметровСостоянияПодключения();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтотОбъект);
	РегистрыСведений.СостоянияПодключенияЕНС.УстановитьСостояниеПодключения(Объект.Организация, СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьЖурналированиеПриИзмененииНаСервере()
	
	УстановитьПериодЖурналирования(ИспользоватьЖурналирование);
	УстановитьСостояниеИнтеграции();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодЖурналирования(Использовать)
	
	Если Не Использовать Тогда
		ПредельнаяДатаЖурналирования = Дата(1, 1, 1);
	Иначе
		ПредельнаяДатаЖурналирования = ПредельнаяДатаЖурналирования();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредельнаяДатаЖурналирования()
	
	ТекущаяДатаСеансаПользователя = ТекущаяДатаСеанса();
	ПредельнаяДата = КонецДня(ТекущаяДатаСеансаПользователя + 86400);
	Возврат ПредельнаяДата;
	
КонецФункции

&НаСервере
Функция НастройкиЖурналированияКорректны(СтруктураПараметров)
	
	НастройкиЖурналированияКорректны = Истина;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ПредельнаяДатаЖурналирования)
		И Не СтруктураПараметров.ИспользоватьЖурналирование Тогда
		НастройкиЖурналированияКорректны = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураПараметров.ПредельнаяДатаЖурналирования)
		И СтруктураПараметров.ИспользоватьЖурналирование Тогда
		НастройкиЖурналированияКорректны = Ложь;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ПредельнаяДатаЖурналирования)
		И СтруктураПараметров.ИспользоватьЖурналирование Тогда
		
		ПредельнаяДата = ПредельнаяДатаЖурналирования();
		НастройкиЖурналированияКорректны =
			КонецДня(СтруктураПараметров.ПредельнаяДатаЖурналирования) = ПредельнаяДата - 86400
			Или КонецДня(СтруктураПараметров.ПредельнаяДатаЖурналирования) = ПредельнаяДата;
		
	КонецЕсли;
		
	Возврат НастройкиЖурналированияКорректны;
	
КонецФункции

&НаСервере
Процедура ПрочитатьДатуПоследнегоОбновления()
	
	ДатаПоследнегоОбновления = РегистрыСведений.ПериодыОбновленияДанныхЕНС.ПолучитьДатуПоследнегоОбновления(Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуПоследнегоОбновления()
	
	НаборЗаписей = РегистрыСведений.ПериодыОбновленияДанныхЕНС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	ОчиститьДанныеПослеДатыЗагрузки();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеПослеДатыЗагрузки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ДанныеЛичногоКабинетаЕНС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ЖурналЗагрузкиЕНС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеПослеПолученияОтвета(Результат, ВходящийКонтекст) Экспорт
		
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяДата = Дата(1,1,1);
	Если ДатаПоследнегоОбновления > ПустаяДата Тогда
		ДатаПоследнегоОбновления = ПустаяДата;
		УстановитьДатуПоследнегоОбновления();
		Элементы.ОчиститьВсеДанные.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
